In [1]:
import pandas as pd
import numpy as np
import re

# create DataFrame

In [2]:
data = {
    'string': ['a', 'b', 'c', 'd', 'e', 'f'],
    'int': [0, 1, 2, 1, 2, 3],
    'float': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [3]:
df = pd.DataFrame(data)
df

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e
5    3.2    3      f

In [4]:
dfWithIndex = pd.DataFrame(data, index=["one", "two", "three", "four", "five", "six"])
dfWithIndex

       float  int string
one      1.5    0      a
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e
six      3.2    3      f

In [5]:
dfWithDict = pd.DataFrame({"float":{"one":1.1, "two":2.2, "three":3.3}, "int":{"two":2, "three":3, "four":4}, "string":{"three":"aaa", "four":"bbb", "five":"ccc"}})
dfWithDict

       float  int string
five     NaN  NaN    ccc
four     NaN  4.0    bbb
one      1.1  NaN    NaN
three    3.3  3.0    aaa
two      2.2  2.0    NaN

# check index is unique

In [6]:
dfWithIndex.index.is_unique

True

# sort by index

In [7]:
dfWithIndex.sort_index()

       float  int string
five     2.9    2      e
four     2.4    1      d
one      1.5    0      a
six      3.2    3      f
three    3.6    2      c
two      1.7    1      b

In [8]:
dfWithIndex.sort_index(axis=1, ascending=False)

      string  int  float
one        a    0    1.5
two        b    1    1.7
three      c    2    3.6
four       d    1    2.4
five       e    2    2.9
six        f    3    3.2

# sort by value

In [9]:
dfWithIndex.sort_values(by=["int", "string"])

       float  int string
one      1.5    0      a
two      1.7    1      b
four     2.4    1      d
three    3.6    2      c
five     2.9    2      e
six      3.2    3      f

# head

In [10]:
df.head()

   float  int string
0    1.5    0      a
1    1.7    1      b
2    3.6    2      c
3    2.4    1      d
4    2.9    2      e

# set columns order

In [11]:
columnsOrderDf = pd.DataFrame(data, columns=['string', 'int', 'float'])
columnsOrderDf

  string  int  float
0      a    0    1.5
1      b    1    1.7
2      c    2    3.6
3      d    1    2.4
4      e    2    2.9
5      f    3    3.2

# get specific column

In [12]:
df["string"]

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

In [13]:
df.string

0    a
1    b
2    c
3    d
4    e
5    f
Name: string, dtype: object

# get specific row

In [14]:
dfWithIndex.loc["three", ["int", "string"]]

int       2
string    c
Name: three, dtype: object

In [15]:
dfWithIndex.iloc[2, [1, 2]]

int       2
string    c
Name: three, dtype: object

# update value

In [16]:
updateValueDf = pd.DataFrame(data)

In [17]:
updateValueDf["string"] = "x"
updateValueDf

   float  int string
0    1.5    0      x
1    1.7    1      x
2    3.6    2      x
3    2.4    1      x
4    2.9    2      x
5    3.2    3      x

In [18]:
updateValueDf["float"] = np.arange(6.)
updateValueDf

   float  int string
0    0.0    0      x
1    1.0    1      x
2    2.0    2      x
3    3.0    1      x
4    4.0    2      x
5    5.0    3      x

In [19]:
series = pd.Series([100, 300, 500], index=[1, 3, 5])
updateValueDf["float"] = series
updateValueDf

   float  int string
0    NaN    0      x
1  100.0    1      x
2    NaN    2      x
3  300.0    1      x
4    NaN    2      x
5  500.0    3      x

# add new column

In [20]:
addNewColumnDf = pd.DataFrame(data)
addNewColumnDf['new_column'] = addNewColumnDf.int > 1
addNewColumnDf

   float  int string  new_column
0    1.5    0      a       False
1    1.7    1      b       False
2    3.6    2      c        True
3    2.4    1      d       False
4    2.9    2      e        True
5    3.2    3      f        True

# delete column

In [21]:
deleteColumnDf_0 = pd.DataFrame(data)
del deleteColumnDf_0["int"]
deleteColumnDf_0

   float string
0    1.5      a
1    1.7      b
2    3.6      c
3    2.4      d
4    2.9      e
5    3.2      f

In [22]:
deleteColumnDf_1 = pd.DataFrame(data)
deleteColumnDf_1.drop(["string"], axis='columns')

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

In [23]:
deleteColumnDf_inplace = pd.DataFrame(data)
deleteColumnDf_inplace.drop(["string"], axis='columns', inplace=True)
deleteColumnDf_inplace

   float  int
0    1.5    0
1    1.7    1
2    3.6    2
3    2.4    1
4    2.9    2
5    3.2    3

# delete record

In [24]:
deleteRecordDf = pd.DataFrame(data)
deleteRecordDf.drop([2,4])

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

In [25]:
deleteRecordDf_inplace = pd.DataFrame(data)
deleteRecordDf_inplace.drop([2,4], inplace=True)
deleteRecordDf_inplace

   float  int string
0    1.5    0      a
1    1.7    1      b
3    2.4    1      d
5    3.2    3      f

# transpose

In [26]:
transposedDf = pd.DataFrame(data)
transposedDf.T

          0    1    2    3    4    5
float   1.5  1.7  3.6  2.4  2.9  3.2
int       0    1    2    1    2    3
string    a    b    c    d    e    f

# sub dataframe

In [27]:
subDfByDict = {"subInt" : df.int[1:5], "subFloat" : df.float[:-3]}
pd.DataFrame(subDfByDict)

   subFloat  subInt
0       1.5     NaN
1       1.7     1.0
2       3.6     2.0
3       NaN     1.0
4       NaN     2.0

In [28]:
dfWithIndex.loc["two":"five", "float":"string"]

       float  int string
two      1.7    1      b
three    3.6    2      c
four     2.4    1      d
five     2.9    2      e

In [29]:
df.iloc[:, :3][df.index % 2 == 0]

   float  int string
0    1.5    0      a
2    3.6    2      c
4    2.9    2      e

# get value array

In [30]:
df.values

array([[1.5, 0, 'a'],
       [1.7, 1, 'b'],
       [3.6, 2, 'c'],
       [2.4, 1, 'd'],
       [2.9, 2, 'e'],
       [3.2, 3, 'f']], dtype=object)

# get index

In [31]:
dfWithIndex.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# get max index

In [32]:
maxIndexDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
maxIndexDf.idxmax()

0    2
1    2
2    2
dtype: int64

# reindex

In [33]:
column_reindex = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California']
)
print(column_reindex)
print("-------------------")
print(column_reindex.reindex(columns=['Texas', 'Utah', 'California']))

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
-------------------
   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [34]:
df.reindex(index=[1,3,5], columns=["float", "string", "not_exist"])

   float string  not_exist
1    1.7      b        NaN
3    2.4      d        NaN
5    3.2      f        NaN

# add

In [35]:
addDf_0_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_0_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_0_0 + addDf_0_1

      0
a   NaN
b  22.0
c  33.0
d   NaN

In [36]:
addDf_1_0 = pd.DataFrame([1,2,3], index=["a", "b", "c"])
addDf_1_1 = pd.DataFrame([20,30,40], index=["b", "c", "d"])
addDf_1_0.add(addDf_1_1, fill_value=0)

      0
a   1.0
b  22.0
c  33.0
d  40.0

# sum

In [37]:
sumDf = pd.DataFrame([[1,2,3], [4,None,6], [7,8,9]])
sumDf

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  8.0  9

In [38]:
sumDf.sum()

0    12.0
1    10.0
2    18.0
dtype: float64

In [39]:
sumDf.sum(skipna=False)

0    12.0
1     NaN
2    18.0
dtype: float64

# accumulation

In [40]:
accumulationDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
accumulationDf.cumsum()

    0   1   2
0   1   2   3
1   5   7   9
2  12  15  18

# describe

In [41]:
describeDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
describeDf.describe()

         0    1    2
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

# apply function

In [42]:
applyFunctionDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyFunctionDf

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [43]:
applyFunctionDf.apply(lambda x : x.max())

0    7
1    8
2    9
dtype: int64

In [44]:
applyFunctionDf.apply(lambda x : x.max(), axis='columns')

0    3
1    6
2    9
dtype: int64

In [45]:
applyFunctionDf.apply(lambda x : pd.Series([x.min(), x.max()], index=['min', 'max']))

     0  1  2
min  1  2  3
max  7  8  9

# apply map

In [46]:
applyMapDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
applyMapDf.applymap(lambda x : x * 10)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

# rank

In [47]:
rankDf = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

In [48]:
rankDf.rank()

     0    1    2
0  1.0  1.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0

In [49]:
rankDf.rank(axis='columns')

     0    1    2
0  1.0  2.0  3.0
1  1.0  2.0  3.0
2  1.0  2.0  3.0

# generate datetime index

In [50]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

# drop NaN

In [51]:
dropNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
dropNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [52]:
dropNanDf.dropna()

     0    1    2
0  1.1  2.2  3.3

In [53]:
dropNanDf.dropna(how='all')

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
3  NaN  11.11  12.12

In [54]:
dropNanDf.dropna(thresh=2)

     0      1      2
0  1.1   2.20   3.30
3  NaN  11.11  12.12

# fill NaN

In [55]:
fillNanDf = pd.DataFrame([
    [1.1, 2.2, 3.3], 
    [4.4, np.NaN, np.NaN],
    [np.NaN, np.NaN, np.NaN], 
    [np.NaN, 11.11, 12.12]
])
fillNanDf

     0      1      2
0  1.1   2.20   3.30
1  4.4    NaN    NaN
2  NaN    NaN    NaN
3  NaN  11.11  12.12

In [56]:
fillNanDf.fillna(-1)

     0      1      2
0  1.1   2.20   3.30
1  4.4  -1.00  -1.00
2 -1.0  -1.00  -1.00
3 -1.0  11.11  12.12

In [57]:
fillNanDf.fillna({0: - 100, 1: -200, 2: -300})

       0       1       2
0    1.1    2.20    3.30
1    4.4 -200.00 -300.00
2 -100.0 -200.00 -300.00
3 -100.0   11.11   12.12

In [58]:
fillNanDf.fillna(method='ffill')

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4   2.20   3.30
3  4.4  11.11  12.12

In [59]:
fillNanDf.fillna(method='ffill', limit=1)

     0      1      2
0  1.1   2.20   3.30
1  4.4   2.20   3.30
2  4.4    NaN    NaN
3  NaN  11.11  12.12

In [60]:
removeDuplicateDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
removeDuplicateDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [61]:
removeDuplicateDf.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [62]:
removeDuplicateDf.drop_duplicates()

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4

In [63]:
removeDuplicateDf.drop_duplicates(['col_0'])

  col_0  col_1
0   one      1
1   two      1

In [64]:
removeDuplicateDf.drop_duplicates(['col_0'], keep='last')

  col_0  col_1
4   one      3
6   two      4

# mapping data

In [65]:
mappingDataDf = pd.DataFrame({
    'col_0': ['one', 'two'] * 3 + ['two'],
    'col_1': [1, 1, 2, 3, 3, 4, 4]
})
mappingDataDf

  col_0  col_1
0   one      1
1   two      1
2   one      2
3   two      3
4   one      3
5   two      4
6   two      4

In [66]:
mappingData = {
    'one': '111',
    'two': '222'
}
mappingData

{'one': '111', 'two': '222'}

In [67]:
mappingDataDf['col_2'] = mappingDataDf['col_0'].map(mappingData)
mappingDataDf

  col_0  col_1 col_2
0   one      1   111
1   two      1   222
2   one      2   111
3   two      3   222
4   one      3   111
5   two      4   222
6   two      4   222

In [68]:
mappingDataDf['col_3'] = mappingDataDf['col_1'].map(lambda x : x * 10)
mappingDataDf

  col_0  col_1 col_2  col_3
0   one      1   111     10
1   two      1   222     10
2   one      2   111     20
3   two      3   222     30
4   one      3   111     30
5   two      4   222     40
6   two      4   222     40

# replace data

In [69]:
replaceDataDf = pd.DataFrame({
    'col_0': [0, 1, 2],
    'col_1': [1, 2, 3],
    'col_2': [2, 3, 4]
})
replaceDataDf

   col_0  col_1  col_2
0      0      1      2
1      1      2      3
2      2      3      4

In [70]:
replaceDataDf.replace({1: np.nan, 2: 999})

   col_0  col_1  col_2
0    0.0    NaN  999.0
1    NaN  999.0    3.0
2  999.0    3.0    4.0

# processing outliers

In [71]:
processingOutliersDf = pd.DataFrame(np.random.randn(1000, 4))
processingOutliersDf.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010010    -0.031736    -0.013209    -0.008111
std       0.943755     1.011638     0.987007     1.033303
min      -3.163435    -3.311336    -3.438794    -3.541025
25%      -0.671807    -0.672879    -0.687994    -0.710906
50%       0.012649    -0.079816    -0.018945     0.030436
75%       0.653443     0.666408     0.639585     0.694187
max       2.820555     2.995973     3.545401     3.418997

In [72]:
processingOutlierColDf = processingOutliersDf[0]
processingOutlierColDf[np.abs(processingOutlierColDf) > 3]

992   -3.163435
Name: 0, dtype: float64

In [73]:
processingOutliersDf[(np.abs(processingOutliersDf) > 3).any(1)]

            0         1         2         3
41   0.570416 -0.539966 -3.438794  1.060060
107 -0.616312 -1.209338  0.725980 -3.044954
220  0.427614 -0.212767  1.631772  3.418997
260  0.288676 -0.487847 -1.301496 -3.541025
289 -0.178733 -1.423928 -0.402416 -3.045601
353  0.928325 -1.151737  3.120291  0.453635
500  0.576562 -0.869003 -0.945506  3.325054
582 -0.635697 -0.655949  3.545401 -0.778945
583  0.421927  0.271331  1.526623 -3.517821
601 -0.867113  0.170451  3.023300  0.440731
641  0.533985 -3.311336  0.157964  0.794338
681 -1.377357 -1.098638 -3.226082  0.735589
772  0.686075  0.747461  0.488565 -3.377220
992 -3.163435  0.611316  0.091257  0.714235

In [74]:
processingOutliersDf[np.abs(processingOutliersDf) > 3]

            0   1   2   3
0         NaN NaN NaN NaN
1         NaN NaN NaN NaN
2         NaN NaN NaN NaN
3         NaN NaN NaN NaN
4         NaN NaN NaN NaN
5         NaN NaN NaN NaN
6         NaN NaN NaN NaN
7         NaN NaN NaN NaN
8         NaN NaN NaN NaN
9         NaN NaN NaN NaN
10        NaN NaN NaN NaN
11        NaN NaN NaN NaN
12        NaN NaN NaN NaN
13        NaN NaN NaN NaN
14        NaN NaN NaN NaN
15        NaN NaN NaN NaN
16        NaN NaN NaN NaN
17        NaN NaN NaN NaN
18        NaN NaN NaN NaN
19        NaN NaN NaN NaN
20        NaN NaN NaN NaN
21        NaN NaN NaN NaN
22        NaN NaN NaN NaN
23        NaN NaN NaN NaN
24        NaN NaN NaN NaN
25        NaN NaN NaN NaN
26        NaN NaN NaN NaN
27        NaN NaN NaN NaN
28        NaN NaN NaN NaN
29        NaN NaN NaN NaN
..        ...  ..  ..  ..
970       NaN NaN NaN NaN
971       NaN NaN NaN NaN
972       NaN NaN NaN NaN
973       NaN NaN NaN NaN
974       NaN NaN NaN NaN
975       NaN NaN NaN NaN
976       NaN NaN NaN NaN
977       NaN NaN NaN NaN
978       NaN NaN NaN NaN
979       NaN NaN NaN NaN
980       NaN NaN NaN NaN
981       NaN NaN NaN NaN
982       NaN NaN NaN NaN
983       NaN NaN NaN NaN
984       NaN NaN NaN NaN
985       NaN NaN NaN NaN
986       NaN NaN NaN NaN
987       NaN NaN NaN NaN
988       NaN NaN NaN NaN
989       NaN NaN NaN NaN
990       NaN NaN NaN NaN
991       NaN NaN NaN NaN
992 -3.163435 NaN NaN NaN
993       NaN NaN NaN NaN
994       NaN NaN NaN NaN
995       NaN NaN NaN NaN
996       NaN NaN NaN NaN
997       NaN NaN NaN NaN
998       NaN NaN NaN NaN
999       NaN NaN NaN NaN

[1000 rows x 4 columns]

In [75]:
processingOutliersDf[np.abs(processingOutliersDf) > 3] = np.sign(processingOutliersDf) * 3
processingOutliersDf

            0         1         2         3
0   -0.511187  0.875191  1.912319  0.552806
1    1.324489 -0.848980  0.814824  0.811043
2   -0.847884 -1.639121  0.473655 -0.014780
3   -0.567057 -0.502641  0.202110 -0.648772
4    0.085956 -0.866047  0.225873 -0.995102
5    1.489243  1.827354 -1.006032  1.374950
6    0.009373 -0.073259 -1.635963  0.318907
7    0.332473 -1.386281 -0.133907 -0.279421
8   -0.725456 -0.301184  1.943421  0.798626
9    0.578037 -0.196174 -0.215540  1.338945
10  -0.445645 -0.911800  0.799733  0.214167
11   0.051028 -0.669992  1.502500 -1.746473
12   2.290000  0.631834 -1.444986  0.176691
13   1.680169  0.077160  1.037150 -0.515729
14   0.994154  1.401851  0.680197  0.617711
15  -0.966721 -0.172754  0.843598  0.849089
16  -0.813171  0.033841  0.008598 -1.641402
17  -1.551310  0.449383 -0.529239  1.668144
18  -0.164001 -2.156868  1.174831  0.324457
19  -1.083512 -0.115496  0.182359 -1.551428
20   0.136504 -0.271796 -0.092842 -1.546169
21   0.753238  0.122134  0.555714  1.364335
22   0.052438  0.160330  0.955196 -1.597087
23  -0.114861 -1.586272 -0.215747  0.148123
24  -1.314055 -0.015594  0.481190  1.802976
25   0.252413  0.787414  0.704701  1.242276
26   1.464545 -1.637361  1.107528  1.622587
27  -1.342775 -0.025076  1.573429 -0.660916
28   0.667060  2.507305 -1.275202 -2.243560
29   1.287470  0.022841 -2.132594 -1.767486
..        ...       ...       ...       ...
970 -0.383619 -1.007347  0.656567  0.958568
971  0.007340 -0.045641  2.330603 -1.391523
972 -0.816585  1.038239 -0.906023 -0.668732
973  0.112439  1.039334 -0.660350  0.281425
974  2.085770  0.519640  0.392830 -0.533566
975 -0.671691 -0.672927 -0.135342  0.164860
976  0.116467  1.347545  1.354666 -2.299113
977 -0.555113 -0.112281  0.084265  0.319037
978  0.240232 -1.388546  0.393941 -0.725318
979 -0.305510  1.791249  0.162387  1.669249
980  0.963312  1.040029 -1.985991 -1.354086
981 -0.726117 -1.898840  0.434537  0.619956
982 -0.832016  1.827268  0.414649 -0.193726
983  1.089401  0.419129 -0.596922 -0.233566
984 -0.084348  2.960353 -0.711600  0.878436
985 -1.336020  0.319067 -0.221545  0.413384
986  0.067133 -0.042778 -0.888061 -0.356922
987 -1.146399 -0.482911 -0.145257 -0.343278
988  0.374809  0.766341  1.549411  0.226763
989  0.281704 -0.463183 -0.389006 -0.759547
990 -0.644489  1.304301  1.055478  1.192018
991 -0.614444 -0.366547 -0.691617  0.878900
992 -3.000000  0.611316  0.091257  0.714235
993  0.094841  0.819977  0.365175 -1.019486
994 -0.051436 -0.557776  1.466054  0.941510
995 -0.672156 -0.787987 -0.458638 -0.364384
996  0.981503 -0.505515 -0.701207  0.294477
997 -0.213118 -2.433367 -2.095333  0.723207
998  1.137925  0.318808 -1.672454 -0.442360
999 -0.176984 -0.357408  0.594208  0.375388

[1000 rows x 4 columns]

# sampling data

In [76]:
samplingDataDf = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
samplingDataDf

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [77]:
samplingDataSampler = np.random.permutation(5)
samplingDataSampler

array([4, 1, 0, 2, 3])

In [78]:
samplingDataDf.take(samplingDataSampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [79]:
samplingDataDf.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

# dummy variable

In [80]:
dummyVariableDf = pd.DataFrame({'col_0': ['b', 'b', 'a', 'c', 'a', 'b']})
dummyVariableDf

  col_0
0     b
1     b
2     a
3     c
4     a
5     b

In [81]:
pd.get_dummies(dummyVariableDf['col_0'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [82]:
dummyVariable = np.random.rand(10)
dummyVariable

array([0.12237438, 0.35120054, 0.10254336, 0.28314105, 0.17698828,
       0.57513208, 0.42255556, 0.22689922, 0.83513231, 0.21950655])

In [83]:
dummyVariableBins = [0, 0.2, 0.4, 0.6, 0.8, 1]
dummyVariableBins

[0, 0.2, 0.4, 0.6, 0.8, 1]

In [84]:
pd.get_dummies(pd.cut(dummyVariable, dummyVariableBins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           1           0           0           0           0
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           1           0           0           0           0
5           0           0           1           0           0
6           0           0           1           0           0
7           0           1           0           0           0
8           0           0           0           0           1
9           0           1           0           0           0

# string function

In [85]:
stringFunctionDf = pd.DataFrame({
    'col_0': ['abc', 'xyz', '123']
})
stringFunctionDf

  col_0
0   abc
1   xyz
2   123

In [86]:
stringFunctionDf['col_0'].str.contains('xy')

0    False
1     True
2    False
Name: col_0, dtype: bool

In [87]:
stringFunctionDf['col_0'].str.findall('[a1]', flags=re.IGNORECASE)

0    [a]
1     []
2    [1]
Name: col_0, dtype: object

In [88]:
stringFunctionDf['col_0'].str.match('[a1]', flags=re.IGNORECASE)

0     True
1    False
2     True
Name: col_0, dtype: bool

# hierarchical indexing

In [89]:
hierarchicalIndexing = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
hierarchicalIndexing

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [90]:
hierarchicalIndexing["col_A"]["col_0"]["a"][2]

3

In [91]:
hierarchicalIndexing.index.names = ['idx_0', 'idx_1']
hierarchicalIndexing.columns.names = ['c_0', 'c_1']
hierarchicalIndexing

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
      2         3     4     5
b     1         6     7     8
      2         9    10    11

In [92]:
hierarchicalIndexing.swaplevel("idx_0", "idx_1")

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_1 idx_0
1     a         0     1     2
2     a         3     4     5
1     b         6     7     8
2     b         9    10    11

In [93]:
hierarchicalIndexing.sort_index(level=1)

c_0         col_A       col_B
c_1         col_0 col_1 col_2
idx_0 idx_1
a     1         0     1     2
b     1         6     7     8
a     2         3     4     5
b     2         9    10    11

In [94]:
hierarchicalIndexing.sum(level="idx_0")

c_0   col_A       col_B
c_1   col_0 col_1 col_2
idx_0
a         3     5     7
b        15    17    19

# indexing with columns

In [95]:
indexingWithColumns = pd.DataFrame({
    'a': range(7), 
    'b': range(7, 0, -1),
    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
    'd': [0, 1, 2, 0, 1, 2, 3]
})
indexingWithColumns

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [96]:
indexingWithColumns.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [97]:
indexingWithColumns.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

# reset index

In [98]:
resetIndex = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    index=[
        ['a', 'a', 'b', 'b'], 
        [1, 2, 1, 2]
    ],
    columns=[
        ['col_A', 'col_A', 'col_B'],
        ['col_0', 'col_1', 'col_2']
    ]
)
resetIndex

    col_A       col_B
    col_0 col_1 col_2
a 1     0     1     2
  2     3     4     5
b 1     6     7     8
  2     9    10    11

In [99]:
resetIndexResult = resetIndex.reset_index()
resetIndexResult

  level_0 level_1 col_A       col_B
                  col_0 col_1 col_2
0       a       1     0     1     2
1       a       2     3     4     5
2       b       1     6     7     8
3       b       2     9    10    11

# join

In [100]:
joinDf_0 = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data': range(7)
})
joinDf_0

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [101]:
joinDf_1 = pd.DataFrame({
    'key': ['a', 'b', 'd'],
    'data': range(3)
})
joinDf_1

   data key
0     0   a
1     1   b
2     2   d

In [102]:
pd.merge(joinDf_0, joinDf_1, on="key", suffixes=('_left', '_right'), how="outer")

   data_left key  data_right
0        0.0   b         1.0
1        1.0   b         1.0
2        6.0   b         1.0
3        2.0   a         0.0
4        4.0   a         0.0
5        5.0   a         0.0
6        3.0   c         NaN
7        NaN   d         2.0

In [103]:
joinDf_2 = pd.DataFrame({
    'key_2': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_2': range(7)
})
joinDf_2

   data_2 key_2
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [104]:
joinDf_3 = pd.DataFrame({
    'key_3': ['a', 'b', 'd'],
    'data_3': range(3)
})
joinDf_3

   data_3 key_3
0       0     a
1       1     b
2       2     d

In [105]:
pd.merge(joinDf_2, joinDf_3, left_on='key_2', right_on='key_3', how="outer")

   data_2 key_2  data_3 key_3
0     0.0     b     1.0     b
1     1.0     b     1.0     b
2     6.0     b     1.0     b
3     2.0     a     0.0     a
4     4.0     a     0.0     a
5     5.0     a     0.0     a
6     3.0     c     NaN   NaN
7     NaN   NaN     2.0     d

In [106]:
joinDf_4 = pd.DataFrame({
    'key_4_0': ['a', 'a', 'b'],
    'key_4_1': [1, 2, 1],
    'val_4': ['A', 'B', 'C']
})
joinDf_4

  key_4_0  key_4_1 val_4
0       a        1     A
1       a        2     B
2       b        1     C

In [107]:
joinDf_5 = pd.DataFrame({
    'key_5_0': ['a', 'a', 'b', 'b'],
    'key_5_1': [1, 1, 1, 2],
    'val_5': ['D', 'E', 'F', 'G']
})
joinDf_5

  key_5_0  key_5_1 val_5
0       a        1     D
1       a        1     E
2       b        1     F
3       b        2     G

In [108]:
pd.merge(joinDf_4, joinDf_5, left_on=['key_4_0', 'key_4_1'], right_on=['key_5_0', 'key_5_1'], how='outer')

  key_4_0  key_4_1 val_4 key_5_0  key_5_1 val_5
0       a      1.0     A       a      1.0     D
1       a      1.0     A       a      1.0     E
2       a      2.0     B     NaN      NaN   NaN
3       b      1.0     C       b      1.0     F
4     NaN      NaN   NaN       b      2.0     G

In [109]:
joinDf_6 = pd.DataFrame({
    'key_6': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data_6': range(7)
})
joinDf_6

   data_6 key_6
0       0     b
1       1     b
2       2     a
3       3     c
4       4     a
5       5     a
6       6     b

In [110]:
joinDf_7 = pd.DataFrame({
    'data_7': range(3),
},
    index=['a', 'b', 'd'],
)
joinDf_7

   data_7
a       0
b       1
d       2

In [111]:
pd.merge(joinDf_6, joinDf_7, left_on='key_6', right_index=True, how='outer')

   data_6 key_6  data_7
0     0.0     b     1.0
1     1.0     b     1.0
6     6.0     b     1.0
2     2.0     a     0.0
4     4.0     a     0.0
5     5.0     a     0.0
3     3.0     c     NaN
6     NaN     d     2.0

In [112]:
joinDf_8 = pd.DataFrame({
    'key_8_0': ['a', 'a', 'b'],
    'key_8_1': [1, 2, 1],
    'val_8': ['A', 'B', 'C']
})
joinDf_8

  key_8_0  key_8_1 val_8
0       a        1     A
1       a        2     B
2       b        1     C

In [113]:
joinDf_9 = pd.DataFrame(
    data={
        'val_9': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_9

    val_9
a 1     D
  1     E
b 1     F
  2     G

In [114]:
pd.merge(joinDf_8, joinDf_9, left_on=['key_8_0', 'key_8_1'], right_index=True, how="outer")

  key_8_0  key_8_1 val_8 val_9
0       a        1     A     D
0       a        1     A     E
1       a        2     B   NaN
2       b        1     C     F
2       b        2   NaN     G

In [115]:
joinDf_10 = pd.DataFrame(
    data={
        'val_10': ['A', 'B', 'C']
    },
    index=[
        ['a', 'a', 'b'],
        [1, 2, 1]
    ]
)
joinDf_10

    val_10
a 1      A
  2      B
b 1      C

In [116]:
joinDf_11 = pd.DataFrame(
    data={
        'val_11': ['D', 'E', 'F', 'G']
    },
    index=[
        ['a', 'a', 'b', 'b'],
        [1, 1, 1, 2]
    ]
)
joinDf_11

    val_11
a 1      D
  1      E
b 1      F
  2      G

In [117]:
pd.merge(joinDf_10, joinDf_11, left_index=True, right_index=True, how="outer")

    val_10 val_11
a 1      A      D
  1      A      E
  2      B    NaN
b 1      C      F
  2    NaN      G

# concate

In [118]:
concateDf_0 = pd.DataFrame(
    data=np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two']
)
concateDf_0

   one  two
a    0    1
b    2    3
c    4    5

In [119]:
concateDf_1 = pd.DataFrame(
    data=5 + np.arange(4).reshape(2, 2), 
    index=['a', 'c'],
    columns=['three', 'four']
)
concateDf_1

   three  four
a      5     6
c      7     8

In [120]:
pd.concat([concateDf_0, concateDf_1], axis=1, keys=['df_0', 'df_1'])

  df_0      df_1
   one two three four
a    0   1   5.0  6.0
b    2   3   NaN  NaN
c    4   5   7.0  8.0

In [121]:
concateDf_2 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
concateDf_2

          a         b         c         d
0 -1.203854  1.688299  1.530202 -0.764328
1  1.178425 -0.916138  0.445158 -0.170332
2 -0.806222 -0.733742 -0.847800  2.584840

In [122]:
concateDf_3 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
concateDf_3

          b         d         a
0  2.233618  1.369793  2.136003
1  0.329812  0.906429 -0.757053

In [123]:
pd.concat([concateDf_2, concateDf_3], ignore_index=True)

          a         b         c         d
0 -1.203854  1.688299  1.530202 -0.764328
1  1.178425 -0.916138  0.445158 -0.170332
2 -0.806222 -0.733742 -0.847800  2.584840
3  2.136003  2.233618       NaN  1.369793
4 -0.757053  0.329812       NaN  0.906429

# combine first

In [125]:
combine_first_0 = pd.DataFrame({
    'a': [1, np.nan, 2, np.nan],
    'b': ['a', None, 'c', None]
})
combine_first_0

     a     b
0  1.0     a
1  NaN  None
2  2.0     c
3  NaN  None

In [126]:
combine_first_1 = pd.DataFrame({
    'a': [100, 200, 300, 400],
    'b': ['AAA', 'BBB', 'CCC', 'DDD']
})
combine_first_1

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [127]:
combine_first_0.combine_first(combine_first_1)

       a    b
0    1.0    a
1  200.0  BBB
2    2.0    c
3  400.0  DDD

# stack / unstack

In [128]:
stack_0 = pd.DataFrame({
    'a': [100, 200, 300, 400],
    'b': ['AAA', 'BBB', 'CCC', 'DDD']
})
stack_0

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [131]:
stack_1 = stack_0.stack()
stack_1

0  a    100
   b    AAA
1  a    200
   b    BBB
2  a    300
   b    CCC
3  a    400
   b    DDD
dtype: object

In [132]:
stack_1.unstack()

     a    b
0  100  AAA
1  200  BBB
2  300  CCC
3  400  DDD

In [136]:
stack_1.unstack(0)

     0    1    2    3
a  100  200  300  400
b  AAA  BBB  CCC  DDD

In [175]:
stack_2 = pd.DataFrame(
    data=np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two']
)
stack_3 = pd.DataFrame(
    data=5 + np.arange(4).reshape(2, 2), 
    index=['a', 'c'],
    columns=['three', 'four']
)
stack_4 = pd.concat([stack_2, stack_3], axis=1, keys=['df_0', 'df_1'])
stack_4.index.names = ['name_0']
stack_4.columns.names = ['name_1', 'name_2']
stack_4

name_1 df_0      df_1
name_2  one two three four
name_0
a         0   1   5.0  6.0
b         2   3   NaN  NaN
c         4   5   7.0  8.0

In [177]:
stack_4.stack("name_1")

name_2         four  one  three  two
name_0 name_1
a      df_0     NaN  0.0    NaN  1.0
       df_1     6.0  NaN    5.0  NaN
b      df_0     NaN  2.0    NaN  3.0
c      df_0     NaN  4.0    NaN  5.0
       df_1     8.0  NaN    7.0  NaN